music_app/app/models/user.rb

  def generate_unique_session_token
    token = SecureRandom::urlsafe_base64
    while User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]

  def reset_session_token
    self.session_token = generate_unique_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-11-16 00:20:41.671586"], ["id", 4]]

  def password=(password)
    @password = password
    self.password_digest = BCrypt::Password.create(password)
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "walterwhite@gmail.com"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2022-11-16 00:10:34.605562"], ["updated_at", "2022-11-16 00:10:34.605562"]]