music_app/app/controllers/users_controller.rb

  def show
    @user = User.find_by(params[:id])
---
SELECT "users".* FROM "users" WHERE (users_url) LIMIT $1  [["LIMIT", 1]]