music_app/app/controllers/users_controller.rb

  def show
    @user = User.find_by(email: params[:email]) #User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "walterwhite@gmail.com"], ["LIMIT", 1]]